cf/Documents/СборочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СборочныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыСобранные</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.СборщикЗаказа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВСборке</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСборочногоЛиста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСборочныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаСобранногоТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСборки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сборщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеНайдено</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Собрать</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/ТипыСборочныхЛистов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСборочныхЛистов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФиксацияЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сборка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/СборочныйЛист/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Заказ, Склад
	|ИЗ
	|	Документ.СборочныйЛист
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ТОВАРЫ В ЯЧЕЙКАХ
	
	|ВЫБРАТЬ
	|	&Период Период, &ВидДвиженияРасход ВидДвижения,
	|	Номенклатура, Ячейка, Сборщик,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА СУММА(Количество + НеНайдено)
	|	ИНАЧЕ СУММА((Количество + НеНайдено) * Упаковка.Коэффициент) КОНЕЦ Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ	Ссылка = &Ссылка И
	|		Ячейка <> &ПустаяЯчейка
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО Номенклатура, Ячейка, Упаковка, Сборщик
	|ИМЕЮЩИЕ СУММА(Количество + НеНайдено) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период, &ВидДвиженияПриход,
	|	Номенклатура, &ЯчейкаНеНайдено, Сборщик,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА СУММА(НеНайдено)
	|	ИНАЧЕ СУММА(НеНайдено * Упаковка.Коэффициент) КОНЕЦ
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ	Ссылка = &Ссылка 
	|		И Ячейка <> &ПустаяЯчейка 
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО Номенклатура, Ячейка, Упаковка, Сборщик
	|ИМЕЮЩИЕ СУММА(НеНайдено) > 0
	|;
	
	// СБОРЩИК ТОВАРА
	
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Ссылка.ДатаСборки = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА &Период
	|		ИНАЧЕ Ссылка.ДатаСборки
	|	КОНЕЦ 				КАК Период,
	|	Сборщик				КАК Сборщик,
	|	Ссылка.Заказ		КАК Заказ,
	|	Ссылка				СборочныйЛист,
	|	Номенклатура		КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	Ссылка.Склад		КАК Склад,
	|   Ячейка,		
	|	СУММА(ВЫБОР КОГДА Количество + НеНайдено > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ)	КАК Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка 
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Сборщик,
	|	Номенклатура,
	|	Упаковка,
	|	Ячейка
	|ИМЕЮЩИЕ СУММА(ВЫБОР КОГДА Количество + НеНайдено > 0 ТОГДА 1 ИНАЧЕ 0 КОНЕЦ) > 0
	|;
	
	// ТОВАРЫ В СБОРКЕ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	Ссылка.Склад 		КАК Склад,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	СУММА(Собрать)   	КАК Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка 
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА Ячейка = &ПустаяЯчейка ТОГДА Ссылка.Склад ИНАЧЕ Ячейка КОНЕЦ,
	|	Ссылка,
	|	Номенклатура,
	|	Упаковка,
	|	Сборщик
	|;

	// ТОВАРЫ СОБРАННЫЕ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	Ссылка				КАК СборочныйЛист,
	|	Ссылка.Склад		КАК Склад,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	Сборщик,
	|	СУММА(Количество) Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество > 0 
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Упаковка,
	|	Сборщик
	|;
	
	// РЕЗЕРВ ТОВАРОВ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	Ссылка.Склад		КАК Размещение,
	|	Ссылка.Заказ		КАК ДокументРезерва,
	|	Номенклатура	    КАК Номенклатура,
	|	СУММА(НеНайдено) Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И НеНайдено > 0
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	Ссылка.Склад		КАК Размещение,
	|	&ЗаказПотеряшек		КАК ДокументРезерва,
	|	Номенклатура	    КАК Номенклатура,
	|	СУММА(НеНайдено) Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И НеНайдено > 0 
	|		И Ссылка.ТипСборочногоЛиста <> Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Номенклатура
	|;
	
	// РезервыВЯчейках
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	Ссылка				КАК СборочныйЛист,
	|	Номенклатура	    КАК Номенклатура,
	|	Ячейка			    КАК Ячейка,
	|	Собрать				КАК Количество
	|ИЗ
	|	Документ.СборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество > 0 
	|		И Ссылка.ТипСборочногоЛиста = Значение(Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек)
	|		И Ячейка <> Значение(Справочник.Ячейки.ПустаяСсылка)
	|;
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЯчейкаНеНайдено", 	Ссылка.Склад.ЯчейкаНеНайдено);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаказПотеряшек", 	Константы.ЗаказРезервПотеряшек.Получить());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 				Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("СборщикЗаказа", 				Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВСборке", 				Пакет[4].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыСобранные", 				Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 				Пакет[6].Выгрузить());
	ДополнительныеСвойства.Вставить("РезервыВЯчейках", 				Пакет[7].Выгрузить());
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = "Сборочный лист " + ?(Данные.Ссылка.ТипСборочногоЛиста = ПредопределенноеЗначение("Перечисление.ТипыСборочныхЛистов.ФиксацияЯчеек"),"(фиксация ячеек)","") + " " + Данные.Номер + " от " + Данные.Дата ;
КонецПроцедуры
